## DNS
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.freshdesk-dkim-01-cds-snc-ca-CNAME will be created
  + resource "aws_route53_record" "freshdesk-dkim-01-cds-snc-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "xhlsf._domainkey.cds-snc.ca"
      + records         = [
          + "wl2201s1.domainkey.freshemail.io",
        ]
      + ttl             = 1800
      + type            = "CNAME"
      + zone_id         = "Z35N8HLYUZDWBH"
    }

  # aws_route53_record.freshdesk-dkim-02-cds-snc-ca-CNAME will be created
  + resource "aws_route53_record" "freshdesk-dkim-02-cds-snc-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "epvl8._domainkey.cds-snc.ca"
      + records         = [
          + "wl2201s2.domainkey.freshemail.io",
        ]
      + ttl             = 1800
      + type            = "CNAME"
      + zone_id         = "Z35N8HLYUZDWBH"
    }

  # aws_route53_record.freshdesk-dkim-03-cds-snc-ca-CNAME will be created
  + resource "aws_route53_record" "freshdesk-dkim-03-cds-snc-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "pgl0m._domainkey.cds-snc.ca"
      + records         = [
          + "wl2201s3.domainkey.freshemail.io",
        ]
      + ttl             = 1800
      + type            = "CNAME"
      + zone_id         = "Z35N8HLYUZDWBH"
    }

  # aws_route53_record.freshdesk-dkim-04-cds-snc-ca-CNAME will be created
  + resource "aws_route53_record" "freshdesk-dkim-04-cds-snc-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "fwdkim.cds-snc.ca"
      + records         = [
          + "spfmx1.domainkey.freshemail.io",
        ]
      + ttl             = 1800
      + type            = "CNAME"
      + zone_id         = "Z35N8HLYUZDWBH"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca-public"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
